# Titanic dataset

## import libraries

In [94]:
import pandas as pd
import numpy as np
import seaborn as sns

## load dataset

In [95]:
df = sns.load_dataset("titanic")

In [96]:
df.shape

(891, 15)

In [97]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [98]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

## creat datadict

* #### Check Data Types

In [99]:
datatypes = pd.DataFrame(df.dtypes, columns=["data types"])

In [100]:
datatypes

            data types
survived         int64
pclass           int64
sex             object
age            float64
sibsp            int64
parch            int64
fare           float64
embarked        object
class         category
who             object
adult_male        bool
deck          category
embark_town     object
alive           object
alone             bool

In [101]:
# check number of uniqe values for object datatypes
{col:df[col].nunique() for col in df if df[col].dtype==object}

{'sex': 2, 'embarked': 3, 'who': 3, 'embark_town': 3, 'alive': 2}

In [102]:
df= df.astype(
    {
        'alive':'category',
        'sex':'category',
        'embarked':'category',
        'who':'category',
        'embark_town':'category',   
    }
)

In [103]:
# check codes in categorial data
df["alive"].cat.categories

Index(['no', 'yes'], dtype='object')

In [104]:
df["sex"].cat.categories

Index(['female', 'male'], dtype='object')

In [105]:
df.alive = df["alive"].cat.codes

In [ ]:
df.sex = df["sex"].cat.codes

In [107]:
datadict = pd.DataFrame(df.dtypes, columns=["dtypes"], dtype=str)
datadict

               dtypes
survived        int64
pclass          int64
sex              int8
age           float64
sibsp           int64
parch           int64
fare          float64
embarked     category
class        category
who          category
adult_male       bool
deck         category
embark_town  category
alive            int8
alone            bool

In [108]:
datadict[datadict["dtypes"]=="category"]

               dtypes
embarked     category
class        category
who          category
deck         category
embark_town  category

In [109]:
datadict[datadict["dtypes"].str.contains("int")]

         dtypes
survived  int64
pclass    int64
sex        int8
sibsp     int64
parch     int64
alive      int8

* #### columns defination

In [129]:
datadict["definations"] = ["Survival",
                                     "A proxy for socio-economic status (SES)",
                                     "Sex" ,
                                     "Age in years" ,
                                     "# of siblings(brother, sister) and spouses ( husband, wife )",
                                     '# of parents / children aboard the Titanic',
                                     'Passenger fare',
                                     'Port of Embarkation', 
                                     "class", 
                                     "sex",
                                     'is adult' ,
                                     'deck',
                                    'Port of Embarkation',
                                    'Survival',
                                    'is alone']
datadict

,dtypes,definations,MissingVal,NUnique,Count
survived,int64,Survival,0,2,891
pclass,int64,A proxy for socio-economic status (SES),0,3,891
sex,int8,Sex,0,2,891
age,float64,Age in years,177,88,714
sibsp,int64,"# of siblings(brother, sister) and spouses ( h...",0,7,891
parch,int64,# of parents / children aboard the Titanic,0,7,891
fare,float64,Passenger fare,0,248,891
embarked,category,Port of Embarkation,2,3,889
class,category,class,0,3,891
who,category,sex,0,3,891
adult_male,bool,is adult,0,2,891
deck,category,deck,688,7,203
embark_town,category,Port of Embarkation,2,3,889
alive,int8,Survival,0,2,891
alone,bool,is alone,0,2,891

* #### check missing values

In [ ]:
datadict['MissingVal'] = df.isnull().sum()
datadict

               dtypes                                 definations  MissingVal
survived        int64                                    Survival           0
pclass          int64                                Ticket class           0
sex              int8                                         Sex           0
age           float64                                Age in years         177
sibsp           int64    # of siblings/spouses aboard the Titanic           0
parch           int64  # of parents / children aboard the Titanic           0
fare          float64                              Passenger fare           0
embarked     category                         Port of Embarkation           2
class        category                                       class           0
who          category                                         sex           0
adult_male       bool                                    is adult           0
deck         category                                        deck         688
embark_town  category                         Port of Embarkation           2
alive            int8                                    Survival           0
alone            bool                                    is alone           0

* #### check number of unique values

In [ ]:
datadict['NUnique']=df.nunique()
datadict

,dtypes,definations,MissingVal,NUnique
survived,int64,Survival,0,2
pclass,int64,Ticket class,0,3
sex,int8,Sex,0,2
age,float64,Age in years,177,88
sibsp,int64,# of siblings/spouses aboard the Titanic,0,7
parch,int64,# of parents / children aboard the Titanic,0,7
fare,float64,Passenger fare,0,248
embarked,category,Port of Embarkation,2,3
class,category,class,0,3
who,category,sex,0,3
adult_male,bool,is adult,0,2
deck,category,deck,688,7
embark_town,category,Port of Embarkation,2,3
alive,int8,Survival,0,2
alone,bool,is alone,0,2

* #### checkcount of each column

In [ ]:
datadict['Count']=df.count()
datadict

,dtypes,definations,MissingVal,NUnique,Count
survived,int64,Survival,0,2,891
pclass,int64,Ticket class,0,3,891
sex,int8,Sex,0,2,891
age,float64,Age in years,177,88,714
sibsp,int64,# of siblings/spouses aboard the Titanic,0,7,891
parch,int64,# of parents / children aboard the Titanic,0,7,891
fare,float64,Passenger fare,0,248,891
embarked,category,Port of Embarkation,2,3,889
class,category,class,0,3,891
who,category,sex,0,3,891
adult_male,bool,is adult,0,2,891
deck,category,deck,688,7,203
embark_town,category,Port of Embarkation,2,3,889
alive,int8,Survival,0,2,891
alone,bool,is alone,0,2,891

## Quick look at descriptive statistics

In [ ]:
df.describe(include='number').T

          count       mean        std   min      25%      50%   75%       max
survived  891.0   0.383838   0.486592  0.00   0.0000   0.0000   1.0    1.0000
pclass    891.0   2.308642   0.836071  1.00   2.0000   3.0000   3.0    3.0000
sex       891.0   0.647587   0.477990  0.00   0.0000   1.0000   1.0    1.0000
age       714.0  29.699118  14.526497  0.42  20.1250  28.0000  38.0   80.0000
sibsp     891.0   0.523008   1.102743  0.00   0.0000   0.0000   1.0    8.0000
parch     891.0   0.381594   0.806057  0.00   0.0000   0.0000   0.0    6.0000
fare      891.0  32.204208  49.693429  0.00   7.9104  14.4542  31.0  512.3292
alive     891.0   0.383838   0.486592  0.00   0.0000   0.0000   1.0    1.0000

In [ ]:
df.describe(include='category').T

            count unique          top freq
embarked      889      3            S  644
class         891      3        Third  491
who           891      3          man  537
deck          203      7            C   59
embark_town   889      3  Southampton  644

## discover the data to get insights

In [119]:
# copy data to avoid corrept the data
titanic = df.copy()

In [120]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,1,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,0,False
1,1,1,0,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,1,False
2,1,3,0,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,1,True
3,1,1,0,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,1,False
4,0,3,1,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,0,True

## looking for correlations

In [125]:
df.corr(numeric_only= True)

,survived,pclass,sex,age,sibsp,parch,fare,adult_male,alive,alone
survived,1.000000,-0.338481,-0.543351,-0.077221,-0.035322,0.081629,0.257307,-0.557080,1.000000,-0.203367
pclass,-0.338481,1.000000,0.131900,-0.369226,0.083081,0.018443,-0.549500,0.094035,-0.338481,0.135207
sex,-0.543351,0.131900,1.000000,0.093254,-0.114631,-0.245489,-0.182333,0.908578,-0.543351,0.303646
age,-0.077221,-0.369226,0.093254,1.000000,-0.308247,-0.189119,0.096067,0.280328,-0.077221,0.198270
sibsp,-0.035322,0.083081,-0.114631,-0.308247,1.000000,0.414838,0.159651,-0.253586,-0.035322,-0.584471
parch,0.081629,0.018443,-0.245489,-0.189119,0.414838,1.000000,0.216225,-0.349943,0.081629,-0.583398
fare,0.257307,-0.549500,-0.182333,0.096067,0.159651,0.216225,1.000000,-0.182024,0.257307,-0.271832
adult_male,-0.557080,0.094035,0.908578,0.280328,-0.253586,-0.349943,-0.182024,1.000000,-0.557080,0.404744
alive,1.000000,-0.338481,-0.543351,-0.077221,-0.035322,0.081629,0.257307,-0.557080,1.000000,-0.203367
alone,-0.203367,0.135207,0.303646,0.198270,-0.584471,-0.583398,-0.271832,0.404744,-0.203367,1.000000